turbulenceFreeModel/sampleSetup_sgsFree_r300/method1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  3.0.1                                 | 
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \\/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
 {
	 version	 2.0;
 	 format	 ascii;
	 class	 dictionary;
	 object	 blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1; 
fastMerge	1;
/*     Back o------------------
                              |
                              o

         	       . 13-------------12
         	     .	 11		10
          	   .	  9		8
          	 .	  7 - - - - - - 6
               .	  5 		4
             .		  3		2
           .		  0-------------1
         .                            .
       .                            .
     .                            . 
   .                            .
  26-------------27           .
  24		 25         . 
  22  		 23       . 
  20 - - - - - - 21     .
  18		 19   .
  17		 16 .
  14-------------15

        o
        |
        --------------------o FRONT

   
    y ^
      |
      o ---> x
     /
   z 

*/



vertices
(
    (0 		0 		0)	// 0
    (9.0 	0 		0)	// 1
    (9.0 	0.016666 	0)	// 2
    (0		0.016666 	0)	// 3
    (9.0 	0.2     	0)	// 4
    (0 		0.2     	0)	// 5
    (9.0 	1.0 		0)	// 6
    (0 		1.0 		0)	// 7
    (9.0	1.8      	0)	// 8
    (0 		1.8     	0)	// 9
    (9.0 	1.983334 	0)	// 10
    (0 		1.983334 	0)	// 11
    (9.0 	2.0 		0)	// 12
    (0 		2.0 		0)	// 13
    (0 		0 		4.0)	// 14
    (9.0 	0 		4.0)	// 15
    (9.0 	0.016666 	4.0)	// 16
    (0 		0.016666	4.0)	// 17
    (9.0 	0.2     	4.0)	// 18
    (0 		0.2     	4.0)	// 19
    (9.0 	1.0 		4.0)	// 20
    (0 		1.0 		4.0)	// 21
    (9.0 	1.8     	4.0)	// 22
    (0 		1.8     	4.0)	// 23
    (9.0 	1.983334 	4.0)	// 24
    (0 		1.983334 	4.0)	// 25
    (9.0 	2.0 		4.0)	// 26
    (0 		2.0 		4.0)	// 27
);

blocks
(
    hex (0  1  2  3  14  15  16  17) (135 5  60) SimpleGrading (1  1        	      1) // bottom: viscous sub-layer 
    hex (3  2  4  5  17  16  18  19) (135 12 60) SimpleGrading (1  12.0004800200      1) // bottom: log-law region
    hex (5  4  6  7  19  18  20  21) (135 20 60) SimpleGrading (1  1	              1) // bottom: outer layer (till core)
    hex (7  6  8  9  21  20  22  23) (135 20 60) SimpleGrading (1  1 		      1) // top:    outer later (till core)
    hex (9  8  10 11 23  22  24  25) (135 12 60) SimpleGrading (1  0.08332999999      1) // top:    log-law region
    hex (11 10 12 13 25  24  26  27) (135 5  60) SimpleGrading (1  1        	      1) // top:    viscous sub-layer
);

edges
(
);

boundary
(
   inlet
   {
       type 		cyclic;
       neighbourPatch   outlet;
       faces
       (
            (14 17  3  0) // (0 3 17 14)
            (17 19  5  3) // (3 5 19 17)
            (19 21  7  5) // (5 7 21 19)
            (21 23  9  7) // (7 9 23 21)
            (23 25 11  9) // (9 11 25 23)
            (25 27 13 11) // (11 13 27 25)
       );
   }
   outlet
   {
       type 		cyclic;
       neighbourPatch   inlet;
       faces
       (
            (16 15  1  2) // (2 1 15 16)
            (18 16  2  4) // (4 2 16 18)
            (20 18  4  6) // (6 4 18 20)
            (22 20  6  8) // (8 6 20 22)
            (24 22  8 10) // (10 8 22 24)
            (26 24 10 12) // (12 10 24 26)
       );
   }
   bottomWall
   {
       type 		wall;
       faces
       (
            (15 14 0 1) // (1 0 14 15)
       );
   }
   topWall
   {
       type 		wall;
       faces
       (
            (27 26 12 13) // (13 12 26 27)
       );
   }
   left
   {
       type 		cyclic;
       neighbourPatch   right;
       faces
       (
            (3   2  1  0) // (0 1 2 3)
            (5   4  2  3) // (3 2 4 5)
            (7   6  4  5) // (5 4 6 7)
            (9   8  6  7) // (7 6 8 9)
            (11 10  8  9) // (9 8 10 11)
            (13 12 10 11) // (11 10 12 13)
       );
   }
   right
   {
       type 		cyclic;
       neighbourPatch   left;
       faces
       (
            (17 16 15 14) // (14 15 16 17)
            (19 18 16 17) // (17 16 18 19)
            (21 20 18 19) // (19 18 20 21)
            (23 22 20 21) // (21 20 22 23)
            (25 24 22 23) // (23 22 24 25)
            (27 26 24 25) // (25 24 26 27)
       );
   }
);

mergePatchPairs
(
);

// ************************************************************************* //
