turbulenceFreeModel/sampleSetup_sgsFree_r300/method1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  p
    {
      solver     		GAMG;
      tolerance 		1e-06;
      relTol     		0.01;
      smoother   		DIC;
      cacheAgglomeration 	true;
      nCellsInCoarsestLevel 	10;
      agglomerator 		faceAreaPair;
      mergeLevels   		1;
    }
  pFinal
    {
      solver     		GAMG;
      tolerance 		1e-06;
      relTol    		0;
      smoother   		DIC;
      cacheAgglomeration 	true;
      nCellsInCoarsestLevel 	10;
      agglomerator 		faceAreaPair;
      mergeLevels   		1;
    }
    /*p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }

    pFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }*/


    "(U|k)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k)Final"
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 		1;
    nCorrectors     		3;
    nNonOrthogonalCorrectors	0;
    pRefCell        		1001;
    pRefValue       		0;
}


// ************************************************************************* //
